---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCollection.GetPointBufferPointer
source: html/99505895-833d-5d85-5099-999884031fe3.htm
---
# Autodesk.Revit.DB.PointClouds.PointCollection.GetPointBufferPointer Method

Returns an unsafe pointer to the buffer in which this collection stores the points.

## Syntax (C#)
```csharp
public IntPtr GetPointBufferPointer()
```

## Returns
The pointer to the collection's storage.